init.el

(use-package general
  :demand t
  :config
  (general-evil-setup)

  (general-create-definer my/leader-keys
    :states '(normal visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "C-SPC")

  (general-create-definer my/local-leader-keys
    :states '(normal visual emacs)
    :keymaps 'override
    :prefix ","
    :global-prefix "SPC m")

  (my/leader-keys
    "SPC" '(execute-extended-command :which-key "execute command")
    "`" '(switch-to-prev-buffer :which-key "prev buffer")
    ";" '(eval-expression :which-key "eval sexp")

    "b" '(:ignore t :which-key "buffer")
    "br"  'revert-buffer
    "bd"  'kill-current-buffer

    "f" '(:ignore t :which-key "file")
    "ff"  'find-file
    "fs" 'save-buffer
    "fr" 'recentf-open-files

    "g" '(:ignore t :which-key "git")

    "h" '(:ignore t :which-key "describe")
    "hv" 'describe-variable
    "he" 'view-echo-area-messages
    "hp" 'describe-package
    "hf" 'describe-function
    "hF" 'describe-face
    "hk" 'describe-key

    "p" '(:ignore t :which-key "project")

    "s" '(:ignore t :which-key "search")

    "t"  '(:ignore t :which-key "toggle")
    "t v" '((lambda () (interactive) (visual-line-mode)) :wk "visual line")

    "w" '(:ignore t :which-key "window")
    "wl"  'windmove-right
    "wh"  'windmove-left
    "wk"  'windmove-up
    "wj"  'windmove-down
    "wd"  'delete-window
    "wu" 'winner-undo
    "wr" 'winner-redo
    )

  (my/local-leader-keys
    "d" '(:ignore t :which-key "debug")
    "e" '(:ignore t :which-key "eval")
    "t" '(:ignore t :which-key "test")
    )
  )

(use-package evil
  :demand t
  :general
  (my/leader-keys
    "wv" 'evil-window-vsplit
    "ws" 'evil-window-split)
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-want-Y-yank-to-eol t)
  ;; move to window when splitting
  (setq evil-split-window-below t)
  (setq evil-vsplit-window-right t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :demand
  :config
  (evil-collection-init))

(use-package evil-goggles
  :after evil
  :demand
  :config
  (evil-goggles-mode)
  (evil-goggles-use-diff-faces))

(use-package which-key
  :demand t
  :init
  (setq which-key-separator " ")
  (setq which-key-prefix-prefix "+")
  ;; (setq which-key-idle-delay 0.5)
  :config
  (which-key-mode))

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))
(setq ns-use-proxy-icon  nil)
(setq frame-title-format nil)

(use-package modus-themes
  ;; :straight (modus-themes :type git :host gitlab :repo "protesilaos/modus-themes" :branch "master")
  :demand
  :init
    (setq modus-operandi-theme-override-colors-alist
        '(("bg-main" . "#fefcf4")
          ("bg-dim" . "#faf6ef")
          ("bg-alt" . "#f7efe5")
          ("bg-hl-line" . "#f4f0e3")
          ("bg-active" . "#e8dfd1")
          ("bg-inactive" . "#f6ece5")
          ("bg-region" . "#c6bab1")
          ("bg-header" . "#ede3e0")
          ("bg-tab-bar" . "#dcd3d3")
          ("bg-tab-active" . "#fdf6eb")
          ("bg-tab-inactive" . "#c8bab8")
          ("fg-unfocused" . "#55556f")))

  (setq modus-vivendi-theme-override-colors-alist
        '(("bg-main" . "#100b17")
          ("bg-dim" . "#161129")
          ("bg-alt" . "#181732")
          ("bg-hl-line" . "#191628")
          ("bg-active" . "#282e46")
          ("bg-inactive" . "#1a1e39")
          ("bg-region" . "#393a53")
          ("bg-header" . "#202037")
          ("bg-tab-bar" . "#262b41")
          ("bg-tab-active" . "#120f18")
          ("bg-tab-inactive" . "#3a3a5a")
          ("fg-unfocused" . "#9a9aab")))

  (defmacro modus-themes-format-sexp (sexp &rest objects)
    `(eval (read (format ,(format "%S" sexp) ,@objects))))

  (dolist (theme '("operandi" "vivendi"))
    (modus-themes-format-sexp
     (setq modus-%1$s-theme-slanted-constructs t
             modus-%1$s-theme-bold-constructs t
             modus-%1$s-theme-fringes 'subtle ; {nil,'subtle,'intense}
             modus-%1$s-theme-mode-line '3d ; {nil,'3d,'moody}
             modus-%1$s-theme-faint-syntax nil
             modus-%1$s-theme-intense-hl-line nil
             modus-%1$s-theme-intense-paren-match nil
             modus-%1$s-theme-no-link-underline t
             modus-%1$s-theme-no-mixed-fonts nil
             modus-%1$s-theme-prompts nil ; {nil,'subtle,'intense}
             modus-%1$s-theme-completions 'moderate ; {nil,'moderate,'opinionated}
             modus-%1$s-theme-diffs nil ; {nil,'desaturated,'fg-only}
             modus-%1$s-theme-org-blocks 'greyscale ; {nil,'greyscale,'rainbow}
             modus-%1$s-theme-headings  ; Read further below in the manual for this one
             '((1 . line)
               (t . rainbow-line-no-bold))
             modus-%1$s-theme-variable-pitch-headings t
             modus-%1$s-theme-scale-headings t
             modus-%1$s-theme-scale-1 1.1
             modus-%1$s-theme-scale-2 1.15
             modus-%1$s-theme-scale-3 1.21
             modus-%1$s-theme-scale-4 1.27
             modus-%1$s-theme-scale-5 1.33)
     theme))
  :config
  ;;Light for the day
  (run-at-time "07:00" (* 60 60 24)
               (lambda () (modus-themes-load-operandi)))

  ;; Dark for the night
	(run-at-time "00:00" (* 60 60 24)
               (lambda () (modus-themes-load-vivendi)))
  (run-at-time "15:00" (* 60 60 24)
               (lambda () (modus-themes-load-vivendi)))

  )

(use-package dashboard
  :demand
  :init
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
  (setq dashboard-center-content t)
  ;; (setq dashboard-startup-banner [VALUE])
  :config
  (dashboard-setup-startup-hook))

(use-package centaur-tabs
  :demand
  :commands (centaur-tabs-mode centaur-tabs-forward centaur-tabs-backward)
  :general
  (general-nvmap "gt" 'centaur-tabs-forward)
  (general-nvmap "gT" 'centaur-tabs-backward)
  :init
  (setq centaur-tabs-set-icons t)
  :config
  (centaur-tabs-mode t)
  )

(use-package centered-cursor-mode
  :general (my/leader-keys "t -" (lambda () (interactive) (centered-cursor-mode 'toggle))))

(use-package hide-mode-line
  :commands (hide-mode-line-mode))

(use-package emacs
  :config
