readme.org
** popup management
Taken from https://github.com/gilbertw1/bmacs/blob/master/bmacs.org#popup-rules
#+begin_src emacs-lisp
  (use-package emacs
    :config
    (defvar my-popups '()
      "A list of popup matchers that determine if a popup can be escaped")

    (cl-defun my/make-popup (buffer-rx &optional (height 0.4))
      (add-to-list 'my-popups buffer-rx)
      (add-to-list 'display-buffer-alist
                   `(,buffer-rx
                     (display-buffer-reuse-window
                      display-buffer-in-side-window)
                     (reusable-frames . visible)
                     (side            . bottom)
                     (window-height   . ,height))))

    (my/make-popup (rx bos "*Messages*" eos))
    (my/make-popup (rx bos "*Backtrace*" eos))
    (my/make-popup (rx bos "*Warnings*" eos))
    (my/make-popup (rx bos "*compilation*" eos))
    (my/make-popup (rx bos "*Help*" eos))
    (my/make-popup (rx bos "*scratch*" eos) 0.4)
    )

#+end_src
* Completion framework
** selectrum
#+BEGIN_SRC emacs-lisp
  (use-package selectrum
    :demand
    :general
    (selectrum-minibuffer-map "C-j" 'selectrum-next-candidate
                              "C-k" 'selectrum-previous-candidate)
    :config
    (selectrum-mode t)
    )
#+END_SRC
** prescient
#+BEGIN_SRC emacs-lisp
  (use-package selectrum-prescient
    :after selectrum
    :demand
    :config
    (prescient-persist-mode t)
    (selectrum-prescient-mode t)
    )

  (use-package company-prescient
    :after company
    :demand
    :config
    (company-prescient-mode t))
#+END_SRC
** marginalia
#+BEGIN_SRC emacs-lisp
  (use-package marginalia
    :after selectrum
    :demand
    :init
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :config (marginalia-mode t))
#+END_SRC
** embark
   Taken from https://github.com/oantolin/embark

   You can act on candidates with =C-o= and ask to remind bindings with =C-h=
#+BEGIN_SRC emacs-lisp
  (use-package embark
    :after selectrum
    :demand
    :general (selectrum-minibuffer-map "C-o" #'embark-act)
    :config
    ;; For Selectrum users:
    (defun current-candidate+category ()
      (when selectrum-active-p
        (cons (selectrum--get-meta 'category)
              (selectrum-get-current-candidate))))

    (add-hook 'embark-target-finders #'current-candidate+category)

    (defun current-candidates+category ()
      (when selectrum-active-p
        (cons (selectrum--get-meta 'category)
              (selectrum-get-current-candidates
               ;; Pass relative file names for dired.
               minibuffer-completing-file-name))))

    (add-hook 'embark-candidate-collectors #'current-candidates+category)

    ;; No unnecessary computation delay after injection.
    (add-hook 'embark-setup-hook 'selectrum-set-selected-candidate))
#+END_SRC
** consult
#+BEGIN_SRC emacs-lisp
  (use-package consult
    :general
    (my/leader-keys
      "s o" '(consult-outline :which-key "outline")
      "s s" 'consult-line
      "y" '(consult-yank-pop :which-key "yank")
      "b b" 'consult-buffer
      ;; TODO consult mark
      "f r" 'consult-recent-file
      "s !" '(consult-flymake :wk "flymake")
      "s p" '(consult-ripgrep :wk "ripgrep")
      "t t" '(consult-theme :wk "theme")
      )
    ;; :init
    ;; (setq consult-preview-key "C-l")
    ;; (setq consult-narrow-key ">")
    :config
    (consult-preview-mode)
    )

  (use-package consult-selectrum
    :after selectrum
    :demand)
#+END_SRC
* Programming helpers
** project
*** projectile
#+BEGIN_SRC emacs-lisp
    (use-package projectile
      :demand
      :general
      (my/leader-keys
       "p" '(:keymap projectile-command-map :which-key "projectile")
       "p a" 'projectile-add-known-project
       "p t" 'projectile-run-vterm)
      :init
      (when (file-directory-p "~/git")
        (setq projectile-project-search-path '("~/git")))
      (setq projectile-completion-system 'default)
      (setq projectile-switch-project-action #'projectile-find-file)
      ;; (add-to-list 'projectile-globally-ignored-directories "straight") ;; TODO
      :config
      (defadvice projectile-project-root (around ignore-remote first activate)
        (unless (file-remote-p default-directory) ad-do-it))
      (projectile-mode))
#+END_SRC
*** perspective
#+BEGIN_SRC emacs-lisp
    (use-package perspective
      :general
      (my/leader-keys
       "<tab> <tab>" 'persp-switch
       "<tab> `" 'persp-switch-last
       "<tab> d" 'persp-kill)
      :config
      (persp-mode))

    (use-package persp-projectile
      :general
      (my/leader-keys
       "p p" 'projectile-persp-switch-project))
#+END_SRC
** git
*** magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :general
    (my/leader-keys
      "g g" 'magit-status
      "g G" 'magit-status-here)
    :init
    (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    )
#+END_SRC
*** TODO forge
#+BEGIN_SRC emacs-lisp :tangle no
;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(use-package forge :after magit)
#+END_SRC

*** git-timemachine
#+begin_src emacs-lisp
  (use-package git-timemachine
    :hook (git-time-machine-mode . evil-normalize-keymaps)
    :init (setq git-timemachine-show-minibuffer-details t)
    :general
    (general-nmap "SPC g t" 'git-timemachine-toggle)
    (git-timemachine-mode-map "C-k" 'git-timemachine-show-previous-revision)
    (git-timemachine-mode-map "C-j" 'git-timemachine-show-next-revision)
    (git-timemachine-mode-map "q" 'git-timemachine-quit)
    )
#+end_src
*** git-gutter
#+begin_src emacs-lisp
  (use-package git-gutter-fringe
    :hook
    ((text-mode
      org-mode
      prog-mode) . git-gutter-mode)
    :config
    (setq-default fringes-outside-margins t)
    )
#+end_src
*** smerge-mode and hydra-smerge
#+begin_src emacs-lisp
  (use-package smerge-mode
    :straight nil
    :ensure nil
    :general
    (my/leader-keys "g m" 'smerge-mode)
    :config
    (defhydra hydra-smerge (:hint nil
                                  :pre (smerge-mode 1)
                                  ;; Disable `smerge-mode' when quitting hydra if
                                  ;; no merge conflicts remain.
                                  :post (smerge-auto-leave))
      "
                                                    ╭────────┐
  Movement   Keep           Diff              Other │ smerge │
  ╭─────────────────────────────────────────────────┴────────╯
     ^_g_^       [_b_] base       [_<_] upper/base    [_C_] Combine
     ^_C-k_^     [_u_] upper      [_=_] upper/lower   [_r_] resolve
     ^_k_ ↑^     [_l_] lower      [_>_] base/lower    [_R_] remove
     ^_j_ ↓^     [_a_] all        [_H_] hightlight
     ^_C-j_^     [_RET_] current  [_E_] ediff             ╭──────────
     ^_G_^                                            │ [_q_] quit"
      ("g" (progn (goto-char (point-min)) (smerge-next)))
      ("G" (progn (goto-char (point-max)) (smerge-prev)))
      ("C-j" smerge-next)
      ("C-k" smerge-prev)
      ("j" next-line)
      ("k" previous-line)
      ("b" smerge-keep-base)
      ("u" smerge-keep-upper)
      ("l" smerge-keep-lower)
      ("a" smerge-keep-all)
      ("RET" smerge-keep-current)
      ("\C-m" smerge-keep-current)
      ("<" smerge-diff-base-upper)
      ("=" smerge-diff-upper-lower)
      (">" smerge-diff-base-lower)
      ("H" smerge-refine)
      ("E" smerge-ediff)
      ("C" smerge-combine-with-next)
      ("r" smerge-resolve)
      ("R" smerge-kill-current)
      ("q" nil :color blue)))
#+end_src
** hydra
#+begin_src emacs-lisp
  (use-package hydra
    :demand
    :config
    (setq lv-use-seperator t))


#+end_src
** Indentation
#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :config
    ;; use common convention for indentation by default
    (setq-default indent-tabs-mode t)
    (setq-default tab-width 2)

    ;; use a reasonable line length
    (setq-default fill-column 120)

    ;; let emacs handle indentation
    (electric-indent-mode +1)
    ;; and auto-close parentheses
    (electric-pair-mode +1)              
    )

  ;; add a visual intent guide
  (use-package highlight-indent-guides
    :hook (prog-mode . highlight-indent-guides-mode)
    ;; :custom
    ;; (highlight-indent-guides-method 'character)
    ;; (highlight-indent-guides-character ?|)
    ;; (highlight-indent-guides-responsive 'stack)
    )
#+END_SRC
** rainbow parenthesis
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :hook (lisp-mode . rainbow-delimiters-mode))
#+END_SRC
