readme.org
** syntax highlighting
#+BEGIN_SRC emacs-lisp
(use-package tree-sitter
  :hook (python-mode . tree-sitter-hl-mode)
  :config (global-tree-sitter-mode))

(use-package tree-sitter-langs
  :after tree-sitter)
#+END_SRC

** company-mode
#+BEGIN_SRC emacs-lisp
    (use-package company
      :demand
      :hook ((lsp-mode . company-mode)
             (emacs-lisp-mode . company-mode))
      :bind
      (:map company-active-map
            ("<tab>" . company-complete-selection))
      :init
      (setq company-minimum-prefix-length 1)
      (setq company-idle-delay 0.0)
      (setq company-backends '(company-dabbrev-code company-capf company-keywords company-files company-dabbrev)))

    ;; (use-package company-box
    ;;   :hook (company-mode . company-box-mode))
#+END_SRC

** envrc
#+begin_src emacs-lisp
  (use-package envrc
    :hook (python-mode . envrc-mode))
#+end_src
** yasnippet
#+begin_src emacs-lisp
    (use-package yasnippet
      :hook
      ((text-mode . yas-minor-mode)
       (prog-mode . yas-minor-mode)
       (org-mode . yas-minor-mode)))
#+end_src
** evil-cleverparens
#+begin_src emacs-lisp
  (use-package evil-cleverparens
    :hook
    (
     (emacs-lisp-mode . evil-cleverparens-mode)
     ;; (clojure-mode . evil-cleverparens-mode)
     )
    ;; (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
    :general
    (evil-cleverparens-mode-map ", (" 'sp-wrap-round)
    :init
    (setq evil-move-beyond-eol t
          evil-cleverparens-use-additional-bindings nil
          evil-cleverparens-use-s-and-S nil
          ;; evil-cleverparens-swap-move-by-word-and-symbol t
          ;; evil-cleverparens-use-regular-insert t
          )
    :config
    (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
    (sp-local-pair 'org-mode "<" nil :actions nil)
    )
#+end_src
** evil-multicursor
The prefix is =g r=, inspect the commands with ~which-key~
#+begin_src emacs-lisp
  (use-package evil-mc
    :commands (evil-mc-make-and-goto-next-match ;C-n
               evil-mc-make-and-goto-prev-match ;C-p
               evil-mc-make-cursor-here ; grh
               evil-mc-undo-all-cursors ; grq
               evil-mc-make-all-cursors ; grm
               evil-mc-make-cursor-move-next-line ; grj
               evil-mc-make-cursor-move-prev-line ; grk
               )
    :config
    (global-evil-mc-mode +1)
    )
#+end_src
** evil-nerd-commenter
#+BEGIN_SRC emacs-lisp
  (use-package evil-nerd-commenter
    :general
    (general-nmap "gcc" 'evilnc-comment-or-uncomment-lines)
    (general-vmap "gc" 'evilnc-comment-or-uncomment-lines)
    )
#+END_SRC
** evil-surround
#+BEGIN_SRC emacs-lisp
  (use-package evil-surround
    :general
    (:states 'visual
             "S" 'evil-surround-region
             "gS" 'evil-Surround-region))
#+END_SRC
** undo fu
#+begin_src emacs-lisp
  (use-package undo-fu
    :general
    (:states 'normal
             "u" 'undo-fu-only-undo
             "\C-r" 'undo-fu-only-redo))
#+end_src
** vterm
#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :general
    (my/leader-keys
      "'" 'vterm-other-window)
    :config
    (setq vterm-shell (executable-find "fish")
          vterm-max-scrollback 10000))
#+END_SRC
* Programming languages
** lsp mode
#+BEGIN_SRC emacs-lisp
  ;; (defun my/lsp-mode-setup ()
  ;;   (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  ;;   (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    ;; :hook (lsp-mode . my/lsp-mode-setup)
    :general
    (my/leader-keys
      "l" '(:keymap lsp-command-map :which-key "lsp"))

    (lsp-mode-map "<tab>" 'company-indent-or-complete-common)
    :init
    (setq lsp-restart 'ignore)
    (setq lsp-eldoc-enable-hover nil)
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook ((lsp-mode . lsp-ui-mode))
    :init
    (setq lsp-ui-doc-show-with-cursor nil)
    (setq lsp-ui-doc-show-with-mouse nil)
    )
#+END_SRC
** dap-mode
#+BEGIN_SRC emacs-lisp
  (use-package dap-mode
    :general
    (my/local-leader-keys
      :keymaps 'python-mode-map
      "d h" '(dap-hydra :wk "hydra"))
    :init
    (setq dap-auto-configure nil)
    :config
    (dap-ui-mode 1))
#+END_SRC
** Python
*** python mode
#+BEGIN_SRC emacs-lisp
  (use-package python-mode
    :init
    (setq dap-python-debugger 'debugpy)
    :config
    (when (executable-find "ipython")
      (setq python-shell-interpreter (executable-find "ipython")     ;; FIXME
            python-shell-interpreter-args "-i --simple-prompt --no-color-info"
            python-shell-prompt-regexp "In \\[[0-9]+\\]: "
            python-shell-prompt-block-regexp "\\.\\.\\.\\.: "
            python-shell-prompt-output-regexp "Out\\[[0-9]+\\]: "
            python-shell-completion-setup-code
            "from IPython.core.completerlib import module_completion"
            python-shell-completion-string-code
            "';'.join(get_ipython().Completer.all_completions('''%s'''))\n")
      (require 'dap-python)
      ))
#+END_SRC

*** lsp-pyright
Here the configuration options: https://github.com/emacs-lsp/lsp-pyright#configuration
#+BEGIN_SRC emacs-lisp
  (use-package lsp-pyright
    :init
    (setq lsp-pyright-typechecking-mode "off")
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp-deferred))))
#+END_SRC
*** pytest
#+begin_src emacs-lisp
(use-package python-pytest
:general
(my/local-leader-keys
    :keymaps 'python-mode-map
    "t h" '(python-pytest-dispatch :wk "dispatch")))
#+end_src
*** flymake 
#+begin_src emacs-lisp
(use-package flymake
:straight nil
:ensure nil
:init
(setq python-flymake-command (executable-find "flake8"))
:general
(general-nmap "] !" 'flymake-goto-next-error)
(general-nmap "[ !" 'flymake-goto-prev-error)
)
#+end_src
*** TODO jupyter
#+begin_src emacs-lisp :tangle no
  (use-package jupyter
    :straight (:no-native-compile t)
    :init
    (defun jupyter-command-venv (&rest args)
      (let ((jupyter-executable (executable-find "jupyter")))
        (with-temp-buffer
          (when (zerop (apply #'process-file jupyter-executable nil t nil args))
            (string-trim-right (buffer-string))))))
    (advice-add 'jupyter-command :override #'jupyter-command-venv))
#+end_src
** Emacs-lisp
#+begin_src emacs-lisp
  (use-package elisp-mode
    :straight nil
    :ensure nil
    :general
    (my/local-leader-keys
      :keymaps '(org-mode-map emacs-lisp-mode-map)
      "e l" '(eval-last-sexp :wk "last sexp"))
    (my/local-leader-keys
      :keymaps '(org-mode-map emacs-lisp-mode-map)
      :states 'visual
      "e" '(eval-last-sexp :wk "sexp")))
#+end_src
** Nix
*** nix mode
#+begin_src emacs-lisp
(use-package nix-mode
:commands (nix-mode) ;;FIXME
:mode "\\.nix\\'")
  #+end_src>
** Clojure
*** Clojure mode
#+begin_src emacs-lisp
(use-package clojure-mode
  :mode "\\.clj$")
#+end_src
*** Cider
#+begin_src emacs-lisp
      (use-package cider
        :commands (cider-jack-in cider-mode)
        :general
        ;; (clojure-mode-map "")
        :init
        (setq nrepl-hide-special-buffers t)
        :config
        (add-hook 'cider-mode-hook #'eldoc-mode))
#+end_src
* File management
** dired
- Jump to current file with =SPC f j=
- Hide details with ~(~
- Hide dotfiles with =H=
- Mark with ~m~, unmark with ~u~
- Invert selection with ~t~
- ~*~ has some helpers for marking
- First mark some files and then ~K~ to "hide" them
- Open directory in right window with ~S-RET~
  + When copying from left window, target will be right window
  + Copy with ~C~
- Open subdir in buffer below with ~I~
- Open files with macos with =O=
- View files with =go= and exit with ~q~

#+BEGIN_SRC emacs-lisp
  (use-package dired
    :straight nil
    :ensure nil
    :general
    (my/leader-keys
      "f d" 'dired
      "f j" 'dired-jump))

  (use-package dired-single
    :after dired
    :general
    (dired-mode-map
     :states 'normal
     "h" 'dired-single-up-directory
     "l" 'dired-single-buffer
     "q" 'quit-window))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+END_SRC

* Org mode
- demote subtree with =M-l=
