init.el

(use-package tree-sitter
  :hook (python-mode . tree-sitter-hl-mode)
  :config (global-tree-sitter-mode))

(use-package tree-sitter-langs
  :after tree-sitter)

(use-package company
  :demand
  :hook ((lsp-mode . company-mode)
         (emacs-lisp-mode . company-mode))
  :bind
  (:map company-active-map
        ("<tab>" . company-complete-selection))
  :init
  (setq company-minimum-prefix-length 1)
  (setq company-idle-delay 0.0)
  (setq company-backends '(company-dabbrev-code company-capf company-keywords company-files company-dabbrev)))

;; (use-package company-box
;;   :hook (company-mode . company-box-mode))

(use-package envrc
  :hook (python-mode . envrc-mode))

(use-package yasnippet
  :hook
  ((text-mode . yas-minor-mode)
   (prog-mode . yas-minor-mode)
   (org-mode . yas-minor-mode)))

(use-package evil-cleverparens
  :hook
  (
   (emacs-lisp-mode . evil-cleverparens-mode)
   ;; (clojure-mode . evil-cleverparens-mode)
   )
  ;; (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
  :general
  (evil-cleverparens-mode-map ", (" 'sp-wrap-round)
  :init
  (setq evil-move-beyond-eol t
        evil-cleverparens-use-additional-bindings nil
        evil-cleverparens-use-s-and-S nil
        ;; evil-cleverparens-swap-move-by-word-and-symbol t
        ;; evil-cleverparens-use-regular-insert t
        )
  :config
  (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
  (sp-local-pair 'org-mode "<" nil :actions nil)
  )

(use-package evil-mc
  :commands (evil-mc-make-and-goto-next-match ;C-n
             evil-mc-make-and-goto-prev-match ;C-p
             evil-mc-make-cursor-here ; grh
             evil-mc-undo-all-cursors ; grq
             evil-mc-make-all-cursors ; grm
             evil-mc-make-cursor-move-next-line ; grj
             evil-mc-make-cursor-move-prev-line ; grk
             )
  :config
  (global-evil-mc-mode +1)
  )

(use-package evil-nerd-commenter
  :general
  (general-nmap "gcc" 'evilnc-comment-or-uncomment-lines)
  (general-vmap "gc" 'evilnc-comment-or-uncomment-lines)
  )

(use-package evil-surround
  :general
  (:states 'visual
           "S" 'evil-surround-region
           "gS" 'evil-Surround-region))

(use-package undo-fu
  :general
  (:states 'normal
           "u" 'undo-fu-only-undo
           "\C-r" 'undo-fu-only-redo))

(use-package vterm
  :general
  (my/leader-keys
    "'" 'vterm-other-window)
  :config
  (setq vterm-shell (executable-find "fish")
        vterm-max-scrollback 10000))

;; (defun my/lsp-mode-setup ()
;;   (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
;;   (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  ;; :hook (lsp-mode . my/lsp-mode-setup)
  :general
  (my/leader-keys
    "l" '(:keymap lsp-command-map :which-key "lsp"))

  (lsp-mode-map "<tab>" 'company-indent-or-complete-common)
  :init
  (setq lsp-restart 'ignore)
  (setq lsp-eldoc-enable-hover nil)
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook ((lsp-mode . lsp-ui-mode))
  :init
  (setq lsp-ui-doc-show-with-cursor nil)
  (setq lsp-ui-doc-show-with-mouse nil)
  )

(use-package dap-mode
  :general
  (my/local-leader-keys
    :keymaps 'python-mode-map
    "d h" '(dap-hydra :wk "hydra"))
  :init
  (setq dap-auto-configure nil)
  :config
  (dap-ui-mode 1))

(use-package python-mode
  :init
  (setq dap-python-debugger 'debugpy)
  :config
  (when (executable-find "ipython")
    (setq python-shell-interpreter (executable-find "ipython")     ;; FIXME
          python-shell-interpreter-args "-i --simple-prompt --no-color-info"
          python-shell-prompt-regexp "In \\[[0-9]+\\]: "
          python-shell-prompt-block-regexp "\\.\\.\\.\\.: "
          python-shell-prompt-output-regexp "Out\\[[0-9]+\\]: "
          python-shell-completion-setup-code
          "from IPython.core.completerlib import module_completion"
          python-shell-completion-string-code
          "';'.join(get_ipython().Completer.all_completions('''%s'''))\n")
    (require 'dap-python)
    ))

(use-package lsp-pyright
  :init
  (setq lsp-pyright-typechecking-mode "off")
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp-deferred))))

(use-package python-pytest
:general
(my/local-leader-keys
    :keymaps 'python-mode-map
    "t h" '(python-pytest-dispatch :wk "dispatch")))

(use-package flymake
:straight nil
:ensure nil
:init
(setq python-flymake-command (executable-find "flake8"))
:general
(general-nmap "] !" 'flymake-goto-next-error)
(general-nmap "[ !" 'flymake-goto-prev-error)
)

(use-package elisp-mode
  :straight nil
  :ensure nil
  :general
  (my/local-leader-keys
    :keymaps '(org-mode-map emacs-lisp-mode-map)
    "e l" '(eval-last-sexp :wk "last sexp"))
  (my/local-leader-keys
    :keymaps '(org-mode-map emacs-lisp-mode-map)
    :states 'visual
    "e" '(eval-last-sexp :wk "sexp")))

(use-package clojure-mode
  :mode "\\.clj$")

(use-package cider
  :commands (cider-jack-in cider-mode)
  :general
  ;; (clojure-mode-map "")
  :init
  (setq nrepl-hide-special-buffers t)
  :config
  (add-hook 'cider-mode-hook #'eldoc-mode))

(use-package dired
  :straight nil
  :ensure nil
  :general
  (my/leader-keys
    "f d" 'dired
    "f j" 'dired-jump))

(use-package dired-single
  :after dired
  :general
  (dired-mode-map
   :states 'normal
   "h" 'dired-single-up-directory
   "l" 'dired-single-buffer
   "q" 'quit-window))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package org
