readme.org
** Org mode configuration
#+BEGIN_SRC emacs-lisp
  (use-package org
    :hook ((org-mode . my/org-mode-setup)
           (org-mode . (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config))))
    :general
    (my/leader-keys
      "C" '(org-capture :wk "capture"))
    (org-mode-map "z i" '(org-toggle-inline-images :wk "inline images"))
    :init
    (setq org-directory "~/Dropbox/org"
          org-image-actual-width nil
          +org-export-directory "~/Dropbox/org/export"
          org-default-notes-file "~/Dropbox/org/personal/tasks/todo.org"
          org-id-locations-file "~/Dropbox/org/.orgids"
          org-agenda-files '("~/dropbox/org/personal/tasks/birthdays.org" "~/dropbox/org/personal/tasks/todo.org" "~/dropbox/Notes/Test.inbox.org")
          ;; org-export-in-background t
          org-catch-invisible-edits 'smart)

	;; disable modules for faster startup
  (setq org-modules
    '(;; ol-w3m
      ;; ol-bbdb
      ;; ol-bibtex
      ol-docview
      ;; ol-gnus
      ;; ol-info
      ;; ol-irc
      ;; ol-mhe
      ;; ol-rmail
      ;; ol-eww
      ))
    (setq org-todo-keywords
          '((sequence "TODO(t)" "PROJ(p)" "|" "DONE(d)")))
    (setq org-capture-templates
          `(("b" "Blog" entry
             (file+headline "personal/tasks/todo.org" "Blog")
             ,(concat "* WRITE %^{Title} %^g\n"
                      "SCHEDULED: %^t\n"
                      ":PROPERTIES:\n"
                      ":CAPTURED: %U\n:END:\n\n"
                      "%i%?"))
            ("d" "New Diary Entry" entry(file+olp+datetree"~/Dropbox/org/personal/diary.org" "Daily Logs")
             "* %^{thought for the day}
          :PROPERTIES:
          :CATEGORY: %^{category}
          :SUBJECT:  %^{subject}
          :MOOD:     %^{mood}
          :END:
          :RESOURCES:
          :END:

          \*What was one good thing you learned today?*:
          - %^{whatilearnedtoday}

          \*List one thing you could have done better*:
          - %^{onethingdobetter}

          \*Describe in your own words how your day was*:
          - %?")
            ("i" "Inbox" entry
             (file+headline "personal/tasks/todo.org" "Inbox")
             ,(concat "* %^{Title}\n"
                      ":PROPERTIES:\n"
                      ":CAPTURED: %U\n"
                      ":END:\n\n"
                      "%i%l"))
            ("u" "New URL Entry" entry
             (file+function "~/Dropbox/org/personal/dailies.org" org-reverse-datetree-goto-date-in-file)
             "* [[%^{URL}][%^{Description}]] %^g %?")
            ("w" "Work" entry
             (file+headline "personal/tasks/todo.org" "Work")
             ,(concat "* TODO [#A] %^{Title} :@work:\n"
                      "SCHEDULED: %^t\n"
                      ":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
                      "%i%?"))

            ))

    ;; (setq org-agenda-custom-commands
    ;;         '(("d" "Dashboard"
    ;;            ((agenda "" ((org-deadline-warning-days 7)))
    ;;             (todo "NEXT"
    ;;                   ((org-agenda-overriding-header "Next Tasks")))
    ;;             (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))
    ;;           ("n" "Next Tasks"
    ;;            ((todo "NEXT"
    ;;                   ((org-agenda-overriding-header "Next Tasks")))))
    ;;           ("W" "Work Tasks" tags-todo "+work-email")
    ;;           ))
    (defun my/org-mode-setup ()
      (org-indent-mode)
      (variable-pitch-mode 1)
      (visual-line-mode 1))

    (defun my/org-babel-tangle-config ()
      (when (string-equal (file-name-directory (buffer-file-name))
                          (expand-file-name user-emacs-directory))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))

    :config
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)

    ;; (efs/org-font-setup)
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("clj" . "src clojure"))
    )
#+END_SRC

#+begin_src emacs-lisp
(use-package org-reverse-datetree
:after org)
#+end_src>
** Auto-tangle on save
Taken from https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#auto-tangle-configuration-files
#+BEGIN_SRC emacs-lisp
#+END_SRC
** better bullets
#+BEGIN_SRC emacs-lisp
  (use-package org-superstar
    :hook (org-mode . org-superstar-mode)
    :init
    (setq org-superstar-headline-bullets-list '("✖" "✚" "◆" "▶" "○")
          org-superstar-special-todo-items t
          org-ellipsis "▼")
    )
#+END_SRC
** todo highlight
#+begin_src emacs-lisp
  (use-package hl-todo
    :hook (prog-mode . hl-todo-mode)
    :init
    (setq hl-todo-keyword-faces
          '(("TODO"   . "#FF4500")
            ("FIXME"  . "#FF0000")
            ("STRT"  . "#A020F0")
            ("PROJ"   . "#1E90FF")))
    )
#+end_src
** org babel
#+BEGIN_SRC emacs-lisp
  (use-package org
    :general
    (my/local-leader-keys
      :keymaps 'org-mode-map
      "," '(org-edit-special :wk "edit")
      "-" '(org-babel-demarcate-block :wk "split block"))
    (my/local-leader-keys
      :keymaps 'org-src-mode-map
      "," '(org-edit-src-exit :wk "exit")) ;;FIXME
    :init
    (setq org-confirm-babel-evaluate nil))

  ;; enable mermaid diagram blocks
  ;; (use-package ob-mermaid
  ;;   :custom (ob-mermaid-cli-path "~/.asdf/shims/mmdc"))
#+END_SRC
** ob-async
#+begin_src emacs-lisp
  (use-package ob-async
    :hook (org-load . (lambda () (require 'ob-async)))
    :init
    (setq ob-async-no-async-languages-alist '("jupyter-python" "jupyter-R" "jupyter-julia")))
#+end_src
** TODO ob-jupyter
#+begin_src emacs-lisp :tangle no
  (use-package jupyter
    :hook (org-load . my/load-ob-jupyter)
    :straight (:no-native-compile t)
    :init
    (setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                         (:pandoc t)
                                                         (:kernel . "python3")))
    (setq org-babel-default-header-args:jupyter-R '((:pandoc t)
                                                    (:async . "yes")
                                                    (:kernel . "ir")))
    (defun my/load-ob-jupyter ()
      (require 'jupyter)
      (require 'ob-jupyter)
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (python . t)
         (jupyter . t)))
      (add-to-list 'org-structure-template-alist '("jp" . "src jupyter-python"))
      ;; Remove text/html since it's not human readable
      (delete :text/html jupyter-org-mime-types)
      ;; (require 'tramp)
      )
    )
#+end_src
** exporters
#+BEGIN_SRC emacs-lisp
(use-package ox-gfm
  :config (eval-after-load "org" '(require 'ox-gfm nil t)))

;; (use-package ox-ipynb
;;   :config (eval-after-load "org" '(require 'ox-ipynb)))
#+END_SRC

** org-tree-slide
#+begin_src emacs-lisp
  (use-package org-tree-slide
    :hook ((org-tree-slide-play . (lambda () (+remap-faces-at-start-present)))
           (org-tree-slide-stop . (lambda () (+remap-faces-at-stop-present))))
    :general
    (org-tree-slide-mode-map "C-j" 'org-tree-slide-move-next-tree)
    (org-tree-slide-mode-map "C-j" 'org-tree-slide-move-previous-tree)
    :init
    (defun +remap-faces-at-start-present ()
      (setq-local face-remapping-alist '((default (:height 2.0) variable-pitch)
                                         (org-verbatim (:height 1.75) org-verbatim)
                                         (org-block (:height 1.25) org-block)))
      (hide-mode-line-mode 1)
      (centaur-tabs-mode 0))
    (defun +remap-faces-at-start-present-term ()
      (interactive)
      (setq-local face-remapping-alist '((default (:height 2.0) variable-pitch)
                                         (org-verbatim (:height 1.75) org-verbatim)
                                         (org-block (:height 1.25) org-block))))
    (defun +remap-faces-at-stop-present ()
      (setq-local face-remapping-alist '((default variable-pitch default)))
      (hide-mode-line-mode 0)
      (centaur-tabs-mode 1))
    (setq org-tree-slide-skip-outline-level 0
          org-tree-slide-modeline-display nil
          org-tree-slide-slide-in-effect nil)
    :config
    (org-tree-slide-presentation-profile)
    )
#+end_src
* TODO missing
** org present
** restart emacs
** hide BEGIN and END in org blocks
** completion in org blocks
** toggle inline images in org
** maximize window
** scratch buffer
	 #+begin_src emacs-lisp
(defun my/scratch-buffer ()
  (interactive)
  (pop-to-buffer "*scratch*"))
#+end_src>
** keybindings
- =, t t= to set headline to TODO
- org-insert-item
  - org-do-demote and org-do-promote

